REMARKS = {
    'intro': (
        'Добро пожаловать в геобот *57 когорты*!\n'
        'Здесь вы можете найти одногруппников из своего города и '
        'общаться с ними через интерфейс бота, договариваться о встречах,'
        ' совместных активностях. Начните с регистрации своего имени и '
        'города. Затем (если в вашем городе уже кто-то зарегистрировался) '
        'вы сможете написать своим одногруппникам-землякам. Если нет - '
        'ждите пополнения. Бот сообщит, когда у вас появится земляк.\n\n'
        '*Зарегистрироваться* здесь /new\n'
        '*Написать всем землякам* здесь /message\n'
        '*География всех студентов* здесь /locations\n'
        '*Часовые пояса студентов* здесь /timezones\n\n'
        'Используйте ↙ Menu в нижнем левом углу экрана. Все команды '
        'всегда под рукой.'
    ),
    'name': (
        'Начнем с имени или псевдонима. Лучше, чтобы он совпадал с тем, '
        'что указано в _Пачке_. Но это не обязательно. Подойдет любой. '
        'Псевдоним может состоять из нескольких слов, но все, что длиннее '
        '20 знаков - будет обрезано.'
    ),
    'locals': (
        'В вашем городе {} помимо вас еще *{}* чел.'
        ' из 57 когорты _Я.Практикума_.'
    ),
    'locals_ino': (
        'В вашей стране {} помимо вас еще *{}* чел.'
        ' из 57 когорты _Я.Практикума_.'
    ),
    'location': (
        'Подтвердите отправку вашей геолокации для определения города '
        'и страны. Кнопка *"Отправить местоположение"* внизу экрана. '
        'Ваши точные координаты не будут сохранены, а только '
        'использованы для определения города.'
    ),
    'submit': (
        'Итак, ваши данные:\n\n*{}*, *{}*, *{}*\n\nВсе правильно? После '
        'сохранения данные нельзя будет поменять. Если что-то неверно '
        '- заполните данные заново без сохранения.'
    ),
    'geo': (
        'Отлично, *{}*. Теперь узнаем ваш город. Если это небольшой город '
        'в регионе, то лучше указать региональный центр. Вы сможете и вам '
        'смогут писать только земляки (для остального есть _Пачка_). '
        'После сохранения изменить город нельзя (чтобы студенты '
        'не скакали по городам). В случае если ваш город не в России, то '
        'поиск земляков будет вестись по всей стране. Бот '
        'подгрузит ваш часовой пояс. Город можно _вписать вручную_ или '
        '_отправить геолокацию_.'
    ),
}
